QuantumLeaps/qpc-examples/arm-cm/game_efm32-slstk3401a/qv/bsp.c
//============================================================================
// Product: "Fly 'n' Shoot" game example, EFM32-SLSTK3401A board, QV kernel
//
// Copyright (C) 2005 Quantum Leaps, LLC. All rights reserved.
//
//                    Q u a n t u m  L e a P s
//                    ------------------------
//                    Modern Embedded Software
//
// SPDX-License-Identifier: GPL-3.0-or-later OR LicenseRef-QL-commercial
//
// This software is dual-licensed under the terms of the open-source GNU
// General Public License (GPL) or under the terms of one of the closed-
// source Quantum Leaps commercial licenses.
//
// Redistributions in source code must retain this top-level comment block.
// Plagiarizing this software to sidestep the license obligations is illegal.
//
// NOTE:
// The GPL does NOT permit the incorporation of this code into proprietary
// programs. Please contact Quantum Leaps for commercial licensing options,
// which expressly supersede the GPL and are designed explicitly for
// closed-source distribution.
//
// Quantum Leaps contact information:
// <www.state-machine.com/licensing>
// <info@state-machine.com>
//============================================================================
#include "qpc.h"                 // QP/C real-time event framework
#include "bsp.h"                 // Board Support Package
#include "app.h"                 // Application

#include "em_device.h"  // the device specific header (SiLabs)
#include "em_chip.h"    // Chip errata (SiLabs)
#include "em_cmu.h"     // Clock Management Unit (SiLabs)
#include "em_gpio.h"    // GPIO (SiLabs)
#include "em_usart.h"   // USART (SiLabs)
#include "display_ls013b7dh03.h" // LS013b7DH03 display (SiLabs/QL)
// add other drivers if necessary...

Q_DEFINE_THIS_FILE

// ISRs defined in this BSP ------------------------------------------------
void SysTick_Handler(void);
void GPIO_EVEN_IRQHandler(void);
void USART0_RX_IRQHandler(void);

// Local-scope objects -----------------------------------------------------
#define LED_PORT    gpioPortF
#define LED0_PIN    4
#define LED1_PIN    5

#define PB_PORT     gpioPortF
#define PB0_PIN     6
#define PB1_PIN     7

// LCD geometry and frame buffer
static uint32_t l_fb[BSP_SCREEN_HEIGHT + 1][BSP_SCREEN_WIDTH / 32U];

// the walls buffer
static uint32_t l_walls[GAME_TUNNEL_HEIGHT + 1][BSP_SCREEN_WIDTH / 32U];

static unsigned l_rnd;  // random seed

static void paintBits(uint8_t x, uint8_t y, uint8_t const *bits, uint8_t h);
static void paintBitsClear(uint8_t x, uint8_t y,
                           uint8_t const *bits, uint8_t h);
#ifdef Q_SPY
    QSTimeCtr QS_tickTime_;
    QSTimeCtr QS_tickPeriod_;

    // QSpy source IDs
    static QSpyId const l_SysTick_Handler = { 0U };
    static QSpyId const l_GPIO_EVEN_IRQHandler = { 0U };

    static USART_TypeDef * const l_USART0 = ((USART_TypeDef *)(0x40010000UL));

    enum AppRecords { // application-specific trace records
        SCORE_STAT = QS_USER,
        COMMAND_STAT
    };

#endif // def Q_SPY

//============================================================================
// Error handler and ISRs...

Q_NORETURN Q_onError(char const * const module, int_t const id) {
    // NOTE: this implementation of the error handler is intended only
    // for debugging and MUST be changed for deployment of the application
    // (assuming that you ship your production code with assertions enabled).
    Q_UNUSED_PAR(module);
    Q_UNUSED_PAR(id);
    QS_ASSERTION(module, id, 10000U); // report assertion to QS

#ifndef NDEBUG
    // light up both LEDs
    GPIO->P[LED_PORT].DOUT |= ((1U << LED0_PIN) | (1U << LED1_PIN));
    for (;;) { // for debugging, hang on in an endless loop...
    }
#endif
    NVIC_SystemReset();
    for (;;) { // explicitly "no-return"
    }
}
//............................................................................
// assertion failure handler for the startup and library code
void assert_failed(char const * const module, int_t const id); // prototype
void assert_failed(char const * const module, int_t const id) {
    Q_onError(module, id);
}

// ISRs used in the application ==============================================

void SysTick_Handler(void); // prototype
void SysTick_Handler(void) {
    static QEvt const tickEvt = QEVT_INITIALIZER(TIME_TICK_SIG);

#ifdef Q_SPY
    {
        // clear SysTick_CTRL_COUNTFLAG
        uint32_t volatile tmp = SysTick->CTRL;
        (void)tmp; // avoid compiler warning about unused local variable
        QS_tickTime_ += QS_tickPeriod_;   // account for the clock rollover
    }
#endif

    //QTIMEEVT_TICK_X(0U, &l_SysTick_Handler); // process time events for rate 0
    QTICKER_TRIG(&QTicker_inst0, &l_SysTick_Handler); // trigger ticker AO

    QACTIVE_PUBLISH(&tickEvt, &l_SysTick_Handler); // publish to all subscribers

    {
        // state of the button debouncing, see below
        static struct ButtonsDebouncing {
            uint32_t depressed;
            uint32_t previous;
        } buttons = { 0U, 0U };
        uint32_t current;
        uint32_t tmp;

       // Perform the debouncing of buttons. The algorithm for debouncing
       // adapted from the book "Embedded Systems Dictionary" by Jack Ganssle
       // and Michael Barr, page 71.
       //
       current = ~GPIO->P[PB_PORT].DIN; // read PB0 and BP1
       tmp = buttons.depressed; // save the debounced depressed buttons
       buttons.depressed |= (buttons.previous & current); // set depressed
       buttons.depressed &= (buttons.previous | current); // clear released
       buttons.previous   = current; // update the history
       tmp ^= buttons.depressed;     // changed debounced depressed
       if ((tmp & (1U << PB0_PIN)) != 0U) {  // debounced PB0 state changed?
           if ((buttons.depressed & (1U << PB0_PIN)) != 0U) {//PB0 depressed?
               static QEvt const trigEvt = QEVT_INITIALIZER(PLAYER_TRIGGER_SIG);
               QACTIVE_PUBLISH(&trigEvt, &l_SysTick_Handler);
           }
       }
    }
    QV_ARM_ERRATUM_838869();
}
//............................................................................
// interrupt handler for testing preemptions
void GPIO_EVEN_IRQHandler(void); // prototype
void GPIO_EVEN_IRQHandler(void) {
    QACTIVE_POST(AO_Tunnel, Q_NEW(QEvt, MAX_PUB_SIG), // for testing...
                 &l_GPIO_EVEN_IRQHandler);
}

//............................................................................
void USART0_RX_IRQHandler(void); // prototype
#ifdef Q_SPY
// ISR for receiving bytes from the QSPY Back-End
// NOTE: This ISR is "QF-unaware" meaning that it does not interact with
// the QF/QK and is not disabled. Such ISRs don't need to call QK_ISR_ENTRY/
// QK_ISR_EXIT and they cannot post or publish events.
//
void USART0_RX_IRQHandler(void) {
    // while RX FIFO NOT empty
    while ((l_USART0->STATUS & USART_STATUS_RXDATAV) != 0) {
        uint32_t b = l_USART0->RXDATA;
        QS_RX_PUT(b);
    }

    QV_ARM_ERRATUM_838869();
}
#else
void USART0_RX_IRQHandler(void) {}
#endif // Q_SPY


//============================================================================
// BSP functions...

void BSP_init(void const * const arg) {
    Q_UNUSED_PAR(arg);

    // Chip errata
    CHIP_Init();

    // NOTE: SystemInit() already called from startup_TM4C123GH6PM.s
    // but SystemCoreClock needs to be updated
    SystemCoreClockUpdate();

